# data.py

certificates_image_urls = [
    "https://taplink.st/p/e/7/f/f/60070519.jpg",
    "https://taplink.st/p/7/d/3/c/60070522.jpg",
    "https://taplink.st/p/9/5/f/7/60070523.jpg",
    "https://taplink.st/p/5/2/1/c/63315574.jpg",
    "https://taplink.st/p/1/6/a/f/63315579.jpg",
    "https://taplink.st/p/3/6/9/5/63315615.jpg",
    "https://taplink.st/p/2/a/7/f/63315678.jpg"
]

bonus_links = [
    {"name": "📂 Способы поддержания энергии", "link": "https://drive.google.com/file/d/10FzzyZLsU9M6u0CpX2oeefE52Xewi7MH/view"},
    {"name": "📂 Правильный Выбор", "link": "https://drive.google.com/file/d/1-bjofIU661BQY4s3MkClEHOF5QiQjr0v/view"},
    #{"name": "📂 File 3", "link": "https://drive.google.com/file/d/1example3"},
]

# data content
data = {
    'About Me': '''
Меня зовут Анастасия, и я рада приветствовать вас в мире самопознания и личностного роста.
‌Я коуч ICF, проводник игры Лила и модератор мастермайндов.
‌Я помогаю людям достигать своих целей, раскрывать потенциал и находить баланс в жизни.
‌Моя задача — поддержать вас на пути к личностному росту и самореализации.
Здесь все про любовь и заботу о себе❤️
''',
    'My_goals':'''
🚀Моя миссия: \n\nСодействовать достижению ваших целей и максимальному раскрытию вашего потенциала. Я верю, что каждый из нас способен на большее! И я готова быть вашим партнером на этом увлекательном пути к саморазвитию и самопознанию
    ''',

    'Menu_services':'''
Здесь Вы можете увидеть мои услуги, чтобы получить больше информации - выберите, что Вас интересует
    ''',

    'free_diag':'''
Это 30-минутная встреча-созвон, которую я всегда провожу перед началом работы в коучинге

Для чего она нужна:

-познакомиться, получить возможность почувствовать мою энергию, понять, подходим ли мы друг другу для дальнейшей работы
-сформулировать и скорректировать (при необходимости) ваш запрос
-исследовать варианты возможного его решения
-прояснение формата дальнейшего нашего взаимодействия

Что вы получаете:
-осмысление и четкая постановка цели с моей помощью
-поймёте, достаточно ли у вас ресурса на ее достижение
-посмотрите на свою цель под разными углами, получите мое видение
-расширите варианты возможных путей достижения цели
-поймете, подхожу ли вам конкретно я, как специалист.
    ''',

    'single_coach': '''
    Этот вариант работы только для моих постоянных клиентов, с которыми мы отработали длинный контракт. Используется для сверки траектории движения, к своему результату.
Почему только для постоянных клиентов?
Одна коуч-сессия — как одна таблетка обезболивающего: может дать инсайт, но не решит запрос/вопрос. Вы получите поверхностный результат.
Я уверенна, что если ваш запрос/вопрос может быть решен за одну сессию, то у вас есть все необходимые ресурсы и инструменты для самостоятельной работы.
Стоимость одной коуч-сессии — 240 зл (60 y.e.) 1,5−2 часа.
    ''',

    'strateg_session':'''
    Стратегическая сессия — длительность 2,5−3 часа, офлайн в Варшаве — 350 зл (90 y.e.) / онлайн по всему миру — 300 зл (75 у.е.)
Стратегическая сессия — это глубокий анализ ваших целей, ценностей и желаний в жизни, а также выстраивание четкого плана и стратегии по достижению этих целей.
Кому и зачем нужна:
-если вы потеряли смысл жизни, нет понимания, в чем ваше призвание
-если хотите быть успешным, счастливым, богатым, но все, что имеете- выгорание и отсутствие сил
-если у вас есть мечта, но нет понимания, как ее осуществить, от этого она кажется нереальной и демотивирует
-если много всего делаете ради благополучной жизни, но ловите только выгорание и слив энергии
Всего одна стратегическая сессия поможет вам:
-построить четкий план действий по достижению своей мечты
-а если нет мечты, то сессия поможет найти мотивацию вставать по утрам
-найти эмоциональную связь со своим будущим и свое призвание
-навести порядок в голове
-определить, что тянет вашу энергию, а куда действительно стоит ее перенаправить
    ''',

    'coach_pack': '''
    Пакет из 4-х сессий (50-ти минутная сессия раз в неделю) — 680 зл (170 y.e.)
Четыре коуч-сессии дают достаточно времени для выявления запроса/вопроса, который сейчас самый актуальный в вашей жизни. За это время возможно определить направление, куда двигаться дальше.
Также возможна более глубокая работа над вашей большой жизненной целью и выявления мелких деталей или запросов, которые могут быть важны для успешного выполнения этой цели.

Пакет из 12-и сессий (50-ти минутная сессия раз в неделю) — 1800 зл (450 y.e.)
Двенадцать коуч-сессии дают достаточно времени для глубокой проработки вашего запроса/вопроса, а также для обнаружения скрытых возражений и сопротивлений. Это время, за которое вы не только получите осознание, но и сделаете действия и получите результат вашего запроса/вопроса
Двенадцать коуч-сессии — это глубокое и основательное погружение, перестройка внутренних процессов и работа над улучшением качества вашей жизни.

🔝На консультациях вы:
— Узнаете какие инструменты помогают из абстрактного желания сформулировать точную и оцифрованную цель, которую понятно как достичь
— Осознаете свои истинные желания
— Получите опыт использования креативных методик при постановке цели
— Определите и сформулируете свою конечную цель, точку Б
— Укрепите уверенность в себе
— Увидите свою ценность и ресурсность
— Поймете, какие таланты и способности помогут достичь цели быстрее
— Проанализируете ситуацию на 360 градусов и увидите эффективные точки приложения усилий
— Составите конкретный, оцифрованный план достижения цели с учетом всех ресурсов, сильных сторон и рисков
— Станете более уверенными, свободными и сможете использовать разные пути к результату
— Избавитесь от убеждений, навязанных другими людьми
— Осознаете свои желания, сильные стороны и таланты, что поможет сформировать качественный план движения к цели, т.е. самореализации в разных сферах
— Получите первые результаты, без оглядки на страхи и сдерживающие убеждения
    ''',

    'mac_cart':'''
    Стоимость офлайн в Варшаве 240 зл (60 y.e.) / онлайн по всему миру — 200 зл (50 у.е.). Продолжительность 1,5 часа.

    Встреча, которая ответит вам на ваши важные жизненные вопросы и поможет развеять сомнения
Кому подходит:

-Кто запутался в жизни
-У кого есть потребность в анализе конкретной жизненной ситуации и своего поведения в ней
-Кто находится в поиске ресурса и энергии
-Выбор из двух и более вариантов

Никакой изотерики, гаданий, волшебства

Ты получишь ответы на все свои волнующие вопросы при помощи мощного инструмента работы с подсознательным- ассоциативных метафорических карт и моих навыков коучинга

Как это происходит:

Ты вытягиваешь карту и называешь ассоциации, вызванные картинками, таким образом озвучивая свои главные беспокойства в жизни. Я грамотно провожу глубокий анализ и подробный разбор всех твоих ответов и ассоциаций

Форматы встречи:

-Групповая встреча
Работа в группе до 6 человек, где каждый прорабатывает свой конкретный вопрос

Стоимость за человека офлайн в Варшаве 120 зл (30 y.e.). Продолжительность 3 часа.

-Индивидуальная работа
Я уделяю время только вам и мы рассматриваем конкретно ваши вопросы

    ''',

    'lila':'''
    Игра Лила- трансформирующая настольная игра, инструмент самопознания, способ свериться, в верном ли направлении вы двигаетесь в жизни, возможность ответить на сложные жизненные вопросы:

-менять ли работу?
-переезжать ли в другую страну?
-разводиться или дать шанс?
-принимать ли решение о крупной покупке?
И многие другие

Каждый день жизнь подбрасывает нам сложные задачи и Лила- способ помочь себе справляться с ними.

Кому подходит:

-Кто запутался
-Кто ищет ответы на свои жизненные вопросы
-Кто не понимает, куда двигаться дальше в работе, отношениях, жизни
-Кто ищет свое предназначение и смысл жизни
-Кто застрял на определённом этапе и ищет ответ, как двигаться дальше

Форматы игры:

-Индивидуальный
Игра проводится только с вами, я уделяю время только вам и мы рассматриваем исключительно ваши вопросы

Стоимость офлайн в Варшаве 350 зл (90 y.e.) / онлайн по всему миру — 300 зл (75 у.е.)

-С подружкой/ мужем
Вы можете прийти на игру с любым комфортным для вас человеком. Прекрасная возможность найти на игре решение совместно накопившихся вопросов/проблем

Стоимость за двоих игроков офлайн в Варшаве 600 зл (150 y.e.) / онлайн по всему миру — 500 зл (125 у.е.)

-Групповой
Работа в группе до 4 человек, где каждый играет с целью решить свои собственные жизненно важные вопросы, такой формат дает шанс узнать о себе новое, наблюдая ход игры и трансформации других участников

Стоимость за человека офлайн в Варшаве 200 зл (50 y.e.)
    ''',

    'book':'''
        Book
    '''
}

# Настройки системы
system_prompt = '''
Ты профессиональный помощник Коуча в чате.

## 1. Общие обязанности и цели
- Коуч продает свои услуги. У Коуча есть большой документ со всеми материалами об услугах.
- Твоя обязанность: Дать Клиенту краткий корректный ответ на русском языке в чате, опираясь на отрывки из этого документа.
- Твоя цель: Отвечать максимально кратко и точно по документу, не придумывать ничего от себя. Если не знаешь ответа - предложи Клиенту связаться с Коучем в Телеграмм 

## 2. Ограничения в общении
- Запрещено общаться на стороннюю тему. Если Клиент задает вопрос не по теме коучинга, не по материалам и продуктам Коуча, ты категорически отказываешься отвечать.

## 3. Секретность документа
- Запрещено упоминать в ответе, что ты анализировал отрывки документов и брал оттуда информацию.
'''

initial_question = """Я - помощник Анастасии.
    У тебя есть вопросы по форматам работы или ценам? 
    А может ты хочешь больше узнать об Анастасии или ее услугах?
    Задавай мне вопросы — я постараюсь на все ответить."""

instruction_prompt = '''
    Проанализируй предыдущий диалог чтобы написать свой ответ последовательным и логичным.
    Категорически запрещено повторяться и первому здороваться.
    Используй следующие фрагменты контекста, чтобы ответить на вопрос в конце.
    Стилистика ответа должна быть поддерживающей беседу в контексте важности и полезности коучинга, внутреннего развития, познания себя.
    Если вы не знаете ответа, просто скажите, что не знаете, не пытайтесь придумывать ответ.
    Тебе запрещено продавать услуги, предлагать услуги. Запрещено спрашивать клиента что его еще интересует.
'''

follow_up_instruction = '''
Проанализируй предыдущую историю диалога, чтобы задать один дополнительный вопрос на основании всей истории.
Больше ничего не пиши. Укажи этот вопрос явно и лаконично. Задавай вопрос в стиле что Вас еще интересует или что бы Вы еще хотели узнать / уточнить.
Но не повторяйся. Если Клиент пишет, что это все, больше ничего не интересует или еще ответ в таком стиле - попрощайся и скажи, что было приятно общаться или в похожем стиле
'''